/*
********************************************************************************
*
*                                 Note.h
*
* File          : Note.h
* Version       : V1.0
* Author        : whq
* Mode          : Thumb2
* Toolchain     : 
* Description   : 
*                
* History       :
* Date          : 2013.07.25
*******************************************************************************/

//2014.11.26    USB 虚拟串口功能
//2013.8.21     USART 增加扩展功能，同一个串口 可以共同工作在两个映射脚上
//2013.8.20     USART,TIM,改进 可通过选择 使能外设
//2013.8.1      SPI,I2C增加所有引脚映射功能
//2013.8.1      USART 增加所有引脚映射功能
//2013.8.1      CAN 驱动测试完成  1,增加所有引脚映射功能
//2013.7.24     TIM驱动完成
//2013.7.25     I2C驱动测试完成
//2013.7.24     SPI驱动完成






